nxp-mcuxpresso/mcux-sdk/boards/mekmimx8qm/demo_apps/hello_world/cm4_core0/pin_mux.c
- {pin_num: D20, pin_signal: PCIE_CTRL0_PERST_B, label: PCIE_WIBT_CTRL0_PERST_B, identifier: PCIE_WIBT_CTRL0_PERST_B}
- {pin_num: A17, pin_signal: PCIE_CTRL0_CLKREQ_B, label: PCIE_WIBT_CLKREQ_B, identifier: PCIE_WIBT_CLKREQ_B}
- {pin_num: A27, pin_signal: PCIE_CTRL1_WAKE_B, label: 'BB_PCIE_CTRL1_WAKE_B/J20B[21]', identifier: BB_PCIE_CTRL1_WAKE_B}
- {pin_num: G25, pin_signal: PCIE_CTRL1_PERST_B, label: 'BB_PCIE_CTRL1_PERST_B/J20B[23]', identifier: BB_PCIE_CTRL1_PERST_B}
- {pin_num: A25, pin_signal: PCIE_CTRL1_CLKREQ_B, label: 'BB_PCIE_CTRL1_CLKREQ_B/J20B[20]', identifier: BB_PCIE_CTRL1_CLKREQ_B}
- {pin_num: B10, pin_signal: ENET0_REFCLK_125M_25M, label: 'BB_ARD_MIK_RST_B/J20D[41]', identifier: BB_ARD_MIK_RST_B}
- {pin_num: A13, pin_signal: ENET1_MDC, label: I2C4_3V3_SCL, identifier: I2C4_3V3_SCL}
- {pin_num: C13, pin_signal: ENET1_MDIO, label: I2C4_3V3_SDA, identifier: I2C4_3V3_SDA}
- {pin_num: A9, pin_signal: ENET0_MDC, label: ENET0_MDC, identifier: ENET0_MDC}
- {pin_num: D10, pin_signal: ENET0_MDIO, label: ENET0_MDIO, identifier: ENET0_MDIO}
- {pin_num: A41, pin_signal: ENET0_RGMII_TXC, label: ETH0_RGMII_TXC, identifier: ETH0_RGMII_TXC}
- {pin_num: E41, pin_signal: ENET0_RGMII_TX_CTL, label: ETH0_RGMII_TX_CTL, identifier: ETH0_RGMII_TX_CTL}
- {pin_num: A43, pin_signal: ENET0_RGMII_TXD0, label: ETH0_RGMII_TXD0, identifier: ETH0_RGMII_TXD0}
- {pin_num: B42, pin_signal: ENET0_RGMII_TXD1, label: ETH0_RGMII_TXD1, identifier: ETH0_RGMII_TXD1}
- {pin_num: A45, pin_signal: ENET0_RGMII_TXD2, label: ETH0_RGMII_TXD2, identifier: ETH0_RGMII_TXD2}
- {pin_num: D42, pin_signal: ENET0_RGMII_TXD3, label: ETH0_RGMII_TXD3, identifier: ETH0_RGMII_TXD3}
- {pin_num: B44, pin_signal: ENET0_RGMII_RXC, label: ETH0_RGMII_RXC, identifier: ETH0_RGMII_RXC}
- {pin_num: E43, pin_signal: ENET0_RGMII_RX_CTL, label: ETH0_RGMII_RX_CTL, identifier: ETH0_RGMII_RX_CTL}
- {pin_num: A47, pin_signal: ENET0_RGMII_RXD0, label: ETH0_RGMII_RXD0, identifier: ETH0_RGMII_RXD0}
- {pin_num: D44, pin_signal: ENET0_RGMII_RXD1, label: ETH0_RGMII_RXD1, identifier: ETH0_RGMII_RXD1}
- {pin_num: C45, pin_signal: ENET0_RGMII_RXD2, label: ETH0_RGMII_RXD2, identifier: ETH0_RGMII_RXD2}
- {pin_num: E45, pin_signal: ENET0_RGMII_RXD3, label: ETH0_RGMII_RXD3, identifier: ETH0_RGMII_RXD3}
- {pin_num: D46, pin_signal: ENET1_RGMII_TXC, label: ENET1_RGMII_TXC, identifier: ENET1_RGMII_TXC}
- {pin_num: B48, pin_signal: ENET1_RGMII_TX_CTL, label: ENET1_RGMII_TX_CTL, identifier: ENET1_RGMII_TX_CTL}
- {pin_num: A49, pin_signal: ENET1_RGMII_TXD0, label: ENET1_RGMII_TXD0, identifier: ENET1_RGMII_TXD0}
- {pin_num: C47, pin_signal: ENET1_RGMII_TXD1, label: ENET1_RGMII_TXD1, identifier: ENET1_RGMII_TXD1}
- {pin_num: G47, pin_signal: ENET1_RGMII_TXD2, label: ENET1_RGMII_TXD2, identifier: ENET1_RGMII_TXD2}
- {pin_num: D48, pin_signal: ENET1_RGMII_TXD3, label: ENET1_RGMII_TXD3, identifier: ENET1_RGMII_TXD3}
- {pin_num: B50, pin_signal: ENET1_RGMII_RXC, label: 'BB_ENET1_RGMII_RXC/J20F[38]', identifier: BB_ENET1_RGMII_RXC}
- {pin_num: E49, pin_signal: ENET1_RGMII_RX_CTL, label: 'BB_ENET1_RGMII_RX_CTL/J20F[33]', identifier: BB_ENET1_RGMII_RX_CTL}
- {pin_num: E51, pin_signal: ENET1_RGMII_RXD0, label: 'BB_ENET1_RGMII_RXD0/J20F[30]', identifier: BB_ENET1_RGMII_RXD0}
- {pin_num: C51, pin_signal: ENET1_RGMII_RXD1, label: 'BB_ENET1_RGMII_RXD1/J20F[35]', identifier: BB_ENET1_RGMII_RXD1}
- {pin_num: D52, pin_signal: ENET1_RGMII_RXD2, label: 'BB_ENET1_RGMII_RXD2/J20F[32]', identifier: BB_ENET1_RGMII_RXD2}
- {pin_num: E53, pin_signal: ENET1_RGMII_RXD3, label: 'BB_ENET1_RGMII_RXD3/J20F[29]', identifier: BB_ENET1_RGMII_RXD3}
- {pin_num: BE39, pin_signal: LVDS0_GPIO00, label: LVDS0_BL_PWM, identifier: LVDS0_BL_PWM}
- {pin_num: BD40, pin_signal: LVDS0_GPIO01, label: LVDS0_TS_INT, identifier: LVDS0_TS_INT}
- {pin_num: BD38, pin_signal: LVDS0_I2C0_SCL, label: LVDS_EN, identifier: LVDS_EN}
- {pin_num: BD36, pin_signal: LVDS0_I2C0_SDA, label: MIPI_DSI0_1_EN, identifier: MIPI_DSI0_1_EN}
- {pin_num: BE37, pin_signal: LVDS0_I2C1_SCL, label: LVDS0_TS_SCL, identifier: LVDS0_TS_SCL}
- {pin_num: BE35, pin_signal: LVDS0_I2C1_SDA, label: LVDS0_TS_SDA, identifier: LVDS0_TS_SDA}
- {pin_num: BD34, pin_signal: LVDS1_GPIO00, label: LVDS1_BL_PWM, identifier: LVDS1_BL_PWM}
- {pin_num: BH36, pin_signal: LVDS1_GPIO01, label: LVDS1_TS_INT, identifier: LVDS1_TS_INT}
- {pin_num: BN35, pin_signal: LVDS1_I2C1_SDA, label: LVDS1_TS_SDA, identifier: LVDS1_TS_SDA}
- {pin_num: BE33, pin_signal: LVDS1_I2C0_SDA, label: WIBT_DISABLE_1V8(LVDS1_I2C0_SDA), identifier: WIBT_DISABLE_1V8}
- {pin_num: BD32, pin_signal: LVDS1_I2C1_SCL, label: LVDS1_TS_SCL, identifier: LVDS1_TS_SCL}
- {pin_num: BL23, pin_signal: MIPI_CSI0_GPIO0_00, label: MIPI_CSI0_RST_B, identifier: MIPI_CSI0_RST_B}
- {pin_num: BM22, pin_signal: MIPI_CSI0_GPIO0_01, label: MIPI_CSI0_EN, identifier: MIPI_CSI0_EN}
- {pin_num: BN15, pin_signal: MIPI_CSI1_GPIO0_00, label: MIPI_CSI1_RST_B, identifier: MIPI_CSI1_RST_B}
- {pin_num: BN13, pin_signal: MIPI_CSI1_GPIO0_01, label: MIPI_CSI1_EN, identifier: MIPI_CSI1_EN}
- {pin_num: BH24, pin_signal: MIPI_CSI0_I2C0_SCL, label: MIPI_CSI0_I2C0_SCL, identifier: MIPI_CSI0_I2C0_SCL}
- {pin_num: BN19, pin_signal: MIPI_CSI0_I2C0_SDA, label: MIPI_CSI0_I2C0_SDA, identifier: MIPI_CSI0_I2C0_SDA}
- {pin_num: BN17, pin_signal: MIPI_CSI1_I2C0_SCL, label: MIPI_CSI1_I2C0_SCL, identifier: MIPI_CSI1_I2C0_SCL}
- {pin_num: BE15, pin_signal: MIPI_CSI1_I2C0_SDA, label: MIPI_CSI1_I2C0_SDA, identifier: MIPI_CSI1_I2C0_SDA}
- {pin_num: BD30, pin_signal: MIPI_DSI0_GPIO0_00, label: MIPI_DSI0_BL_PWM, identifier: MIPI_DSI0_BL_PWM}
- {pin_num: BM24, pin_signal: MIPI_DSI1_GPIO0_00, label: MIPI_DSI1_BL_PWM, identifier: MIPI_DSI1_BL_PWM}
- {pin_num: BD28, pin_signal: MIPI_DSI0_GPIO0_01, label: MIPI_DSI0_TS_INT_B, identifier: MIPI_DSI0_TS_INT_B}
- {pin_num: BK24, pin_signal: MIPI_DSI1_GPIO0_01, label: MIPI_DSI1_TS_INT_B, identifier: MIPI_DSI1_TS_INT_B}
- {pin_num: BE29, pin_signal: MIPI_DSI0_I2C0_SCL, label: MIPI_DSI0_TS_SCL, identifier: MIPI_DSI0_TS_SCL}
- {pin_num: BE31, pin_signal: MIPI_DSI0_I2C0_SDA, label: MIPI_DSI0_TS_SDA, identifier: MIPI_DSI0_TS_SDA}
- {pin_num: BE27, pin_signal: MIPI_DSI1_I2C0_SCL, label: MIPI_DSI1_TS_SCL, identifier: MIPI_DSI1_TS_SCL}
- {pin_num: BG25, pin_signal: MIPI_DSI1_I2C0_SDA, label: MIPI_DSI1_TS_SDA, identifier: MIPI_DSI1_TS_SDA}
- {pin_num: BA3, pin_signal: SPI0_CS1, label: BT_SAI0_TXC(SPI0_CS1), identifier: BT_SAI0_TXC}
- {pin_num: AY2, pin_signal: SPI2_CS1, label: BT_SAI0_TXFS(SPI2_CS1), identifier: BT_SAI0_TXFS}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "pin_mux.h"
#include "fsl_common.h"
#include "main/imx8qm_pads.h"
#include "svc/pad/pad_api.h"

